class Subjects {
  Subjects(this.subjects);
  Map<int, String> subjects;
}

class Schedule {
  Schedule(Map<String, Map<int, String>> scheduleRaw) {
    scheduleRaw.forEach((key, value) => dayToSubjects[key] = Subjects(value));
  }
  Map<String, Subjects> dayToSubjects = {};
}

class ScheduleData {
  ScheduleData() {
    groupToSchedule = {};
    dataRaw.forEach((key, value) => groupToSchedule[key] = Schedule(value));
  }

  Map<String, Schedule> groupToSchedule = {};

  List<String> getGroupsNames() {
    return groupToSchedule.keys.toList();
  }

  Schedule getScheduleForGroup(String? groupName) {
    return groupToSchedule[groupName]!;
  }

  String getDayName(int dayIndex) {
    switch (dayIndex) {
      case 0:
        return "Понеділок";
      case 1:
        return "Вівторок";
      case 2:
        return "Середа";
      case 3:
        return "Четвер";
      case 4:
        return "П'ятниця";
      case 5:
        return "Субота";
      default:
    }
    return '';
  }
}

Map<String, Map<String, Map<int, String>>> dataRaw = {
  "KБ-41": {
    "Понеділок": {
      4: 'Технології розслідування інцидентів інформаційної безпеки: Лекція',
      5: 'Безпека програмного забезпечення: Лекція',
    },
    "Вівторок": {
      3: 'Основи охорони праці та безпека життєдіяльності: Практична',
      4: 'Контрольно-вимірювальна апаратура інформаційної безпеки: Лекція',
      7: 'Організаційне забезпечення технічного захисту інформації: Лекція'
    },
    "Середа": {
      1: 'Безпека програмного забезпечення: Лабораторна',
      2: 'Безпека програмного забезпечення: Лабораторна',
      3: 'Основи охорони праці та безпека життєдіяльності: Лабораторна',
      7: 'Системи автентифікації і управління доступом: Лабораторна'
    },
    "Четвер": {
      1: 'Системи виявлення вторгнень: Лекція',
      3: 'Системи автентифікації і управління доступом: Лабораторна'
    },
    "П'ятниця": {
      1: 'Системи виявлення вторгнень: Лекція',
      3: 'Мікропроцесори в системах захисту інформації: Практична'
    },
    "Субота": {2: 'Системи виявлення вторгнень: Практична'},
  },
  "KБ-42": {
    "Понеділок": {
      4: 'Технології розслідування інцидентів інформаційної безпеки: Лекція',
      5: 'Безпека програмного забезпечення: Лекція'
    },
    "Вівторок": {
      2: 'Контрольно-вимірювальна апаратура інформаційної безпеки: Лекція',
      3: 'Основи охорони праці та безпека життєдіяльності: Лекція',
      4: 'Організаційне забезпечення технічного захисту інформації: Практична',
      6: 'Контрольно-вимірювальна апаратура інформаційної безпеки: Лабораторна',
      7: 'Мікропроцесори в системах технічного захисту інформації: лабораторна'
    },
    "Середа": {
      1: 'Контрольно-вимірювальна апаратура інформаційної безпеки: Лабораторна',
      2: 'Мікропроцесори в системах технічного захисту інформації: Лабораторна',
      3: 'Технології розслідування інцидентів інформаційної безпеки: Лабораторна',
      4: 'Технології розслідування інцидентів інформаційної безпеки: Лабораторна',
    },
    "Четвер": {
      2: 'Мікропроцесори в системах технічного захисту інформації: Практична',
    },
    "П'ятниця": {
      1: 'Мікропроцесори в системах технічного захисту інформації: Лекція',
    },
  },
  "KБ-43": {
    "Понеділок": {
      1: 'Системи автенифікації і управління доступорм: Лабораторна',
      2: 'Системи автенифікації і управління доступорм: Лабораторна',
      3: 'Діагностика комп`ютерних засобів: Практична'
    },
    "Вівторок": {
      1: 'Комп`ютерні засоби опрацювання сигналів: Лекція',
      4: 'Технології проектування комп`ютерних систем: Лабораторна',
      6: 'Проектування комп`ютерних засобів обробки сигналів і зображень: Лабораторна'
    },
    "Середа": {
      1: 'Технології проектування комп`ютерних систем: Лабораторна',
      2: 'Архітектура спеціалізованих комп`ютерних систем: Лекція',
      3: 'Захист інформації в комп`ютерних системах: Лабораторна'
    },
    "Четвер": {
      4: 'Основи охорони праці та безпека життєдіяльності: Лабораторна',
      5: 'Архітектура спеціалізованих комп`ютерних систем: Лабораторна',
      6: 'Системи охорони державної таємниці: Лабораторна'
    },
    "П'ятниця": {
      3: 'Основи охорони праці та безпека життєдіяльності: Лабораторна',
      5: 'Технології розслідування інцидентів інформаційної безпеки: Лабораторна',
      6: 'Системи охорони державної таємниці: Лабораторна',
      7: 'Захист інформації в комп`ютерних системах: Лекція'
    },
    "Субота": {
      6: 'Технології розслідування інцидентів інформаційної безпеки: Лабораторна',
      7: 'Технології розслідування інцидентів інформаційної безпеки: Лабораторна'
    },
  },
  "KБ-44": {
    "Понеділок": {
      3: 'Основи охорони праці та безпека життєдіяльності: Практична',
      4: 'Технології розслідування інцидентів інформаційної безпеки: Лекція',
      5: 'Безпека програмного забезпечення: Лекція'
    },
    "Вівторок": {
      2: 'Аварійне планування та відновлення інформаційних систем: Лекція',
      3: 'Основи охорони праці та безпека житєдіяльності: Лекція'
    },
    "Середа": {
      2: 'Аудит інформаційної безпеки: Лекція',
      3: 'Аварійне планування та відновлення інформаційних систем: Лабораторна',
      4: 'Аварійне планування та відновлення інформаційних систем: Лабораторна',
      5: 'Стандартизація, сертифікація, ліцензування та акредитація: Практична'
    },
    "Четвер": {
      6: 'Аудит інформаційної безпеки: Лабораторна',
      7: 'Аудит інформаційної безпеки: Лабораторна'
    },
    "П'ятниця": {
      6: 'Аудит інформаційної безпеки: Лабораторна',
      7: 'Аудит інформаційної безпеки: Лабораторна'
    },
    "Субота": {
      3: 'Технології розслідування інцидентів інформаційної безпеки: Лабораторна',
      4: 'Технології розслідування інцидентів інформаційної безпеки: Лабораторна'
    },
  },
};
